ams/src/InformationRegisters/ДатаМобайл_ФоновыеЗадания/ДатаМобайл_ФоновыеЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатаМобайл_ФоновыеЗадания</name>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторФоновогоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ДатаМобайл_ШаблоныДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументТСД</name>
    <type>
      <types>CatalogRef.ДатаМобайл_ДокументыТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТСД</name>
    <type>
      <types>ExchangePlanRef.ДатаМобайл_СписокТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсходныйДокумент</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/ДатаМобайл_ФоновыеЗадания/ManagerModule.bsl
Процедура Автовыгрузка(ИдентификаторЗадания = "") Экспорт 
	
	Модуль_ОбщегоНазначенияКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	КодОсновногоЯзыка = Модуль_ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка();
	
	ЗапросШаблоновАвтовыгрузка = Новый Запрос();
	ЗапросШаблоновАвтовыгрузка.Текст = 
	"ВЫБРАТЬ
	|	ДатаМобайл_ШаблоныДокументов.УсловиеВыгрузки КАК УсловиеВыгрузки,
	|	ДатаМобайл_ШаблоныДокументов.ВидДокумента КАК ВидДокумента,
	|	ДатаМобайл_ШаблоныДокументов.Ссылка КАК Ссылка,
	|	ДатаМобайл_ШаблоныДокументов.ИмяТабличнойЧастиПодбор КАК ИмяТабличнойЧастиПодбор,
	|	ДатаМобайл_ШаблоныДокументов.УдалениеСтарыхДокументов КАК УдалениеСтарыхДокументов,
	|	ДатаМобайл_ШаблоныДокументов.МаркировкаВыгружатьРоботом КАК МаркировкаВыгружатьРоботом,
	|	ДатаМобайл_ШаблоныДокументов.ФоноваяАвтовыгрузкаКоличество КАК ФоноваяАвтовыгрузкаКоличество
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	НЕ ДатаМобайл_ШаблоныДокументов.ПометкаУдаления И (ДатаМобайл_ШаблоныДокументов.ВыгружатьРоботом ИЛИ ДатаМобайл_ШаблоныДокументов.МаркировкаВыгружатьРоботом)
	|	И ДатаМобайл_ШаблоныДокументов.ФоноваяАвтовыгрузка";   
	
	ШаблоныАвтовыгрузка = ЗапросШаблоновАвтовыгрузка.Выполнить().Выгрузить();
	
	ТекущаяДата = ДатаМобайл_ОбщийМодуль.ПолучитьТекущуюДату();
	
	Для каждого ШаблонАвтовыгрузки Из ШаблоныАвтовыгрузка Цикл
		
		ЗапросДокументовАвтовыгрузка = Новый Запрос();
		ЗапросДокументовАвтовыгрузка.Текст =  	
		"ВЫБРАТЬ ПЕРВЫЕ &Первые
		|	ДатаМобайл_ФоновыеЗадания.ИсходныйДокумент КАК Ссылка
		|ИЗ
		|	РегистрСведений.ДатаМобайл_ФоновыеЗадания КАК ДатаМобайл_ФоновыеЗадания
		|ГДЕ
		|	ДатаМобайл_ФоновыеЗадания.Шаблон = &Шаблон"; 
		
		ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "&Первые", ШаблонАвтовыгрузки.ФоноваяАвтовыгрузкаКоличество);
			
		ЗапросДокументовАвтовыгрузка.УстановитьПараметр("Шаблон", ШаблонАвтовыгрузки.Ссылка);
		
		ДокументыАвтовыгрузка = ЗапросДокументовАвтовыгрузка.Выполнить().Выгрузить();   
		
		Если ДокументыАвтовыгрузка.Количество() = 0 Тогда
				
			ЗапросДокументовАвтовыгрузка = Новый Запрос();
			ЗапросДокументовАвтовыгрузка.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ ПЕРВЫЕ &Первые
			|	Документ1С.Ссылка КАК ИсходныйДокумент
			|ПОМЕСТИТЬ ВТ_Документы		
			|ИЗ
			|	Документ.ПриобретениеТоваровУслуг КАК Документ1С		
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
			|		ПО Документ1С.Ссылка = ДатаМобайл_ДокументыТСД.ИсходныйДокумент
			|		И ДатаМобайл_ДокументыТСД.Шаблон = &Шаблон
			|		И 3=3
			|ГДЕ
			|	НЕ Документ1С.ПометкаУдаления
			|	И ДатаМобайл_ДокументыТСД.Ссылка ЕСТЬ NULL
			|   И 2=2
			|	И (&УсловиеВключения)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "ПриобретениеТоваровУслуг", ШаблонАвтовыгрузки.ВидДокумента);
			ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "&УсловиеВключения", ?(СокрЛП(ШаблонАвтовыгрузки.УсловиеВыгрузки) = "", "1=1", ШаблонАвтовыгрузки.УсловиеВыгрузки));
			
			Если ШаблонАвтовыгрузки.УдалениеСтарыхДокументов <> 0 Тогда
				ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "2=2", "Документ1С.Ссылка.Дата > &ДатаУдаления");
				ЗапросДокументовАвтовыгрузка.УстановитьПараметр("ДатаУдаления", ТекущаяДата - ШаблонАвтовыгрузки.УдалениеСтарыхДокументов * 86400);				
			КонецЕсли;      
			
			ЗапросДокументовАвтовыгрузка.УстановитьПараметр("Шаблон", ШаблонАвтовыгрузки.Ссылка);
				
			Если ШаблонАвтовыгрузки.ВидДокумента = "ЗаказКлиента" И Найти(ШаблонАвтовыгрузки.УсловиеВыгрузки, "&СостоянияЗаказовКлиентов") > 0 Тогда
				ДатаМобайл_ОбщийМодуль.СкорректироватьЗапросАвтовыгрузкиЗаказКлиента(ЗапросДокументовАвтовыгрузка.Текст);
			Иначе
				ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "ПОМЕСТИТЬ ВТ_Документы", "");	
			КонецЕсли;
			
			Для каждого СтрПараметра Из ШаблонАвтовыгрузки.Ссылка.ПараметрыУсловияВыгрузки Цикл
				ЗапросДокументовАвтовыгрузка.УстановитьПараметр(СтрПараметра.ИмяПараметра, СтрПараметра.ЗначениеПараметра);
			КонецЦикла;
			
			Если ШаблонАвтовыгрузки.Ссылка.ПараметрыУсловияВыгрузкиТЧ.Количество() > 0 Тогда
				Если Не ШаблонАвтовыгрузки.Ссылка.ИспользоватьПодбор И ШаблонАвтовыгрузки.Ссылка.ИспользоватьПриемку Тогда
					ИмяТЧ = ШаблонАвтовыгрузки.Ссылка.ИмяТабличнойЧастиПриемка;
				Иначе
					ИмяТЧ = ШаблонАвтовыгрузки.Ссылка.ИмяТабличнойЧастиПодбор;
				КонецЕсли;
				
				ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "И 3=3", "
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ШаблонАвтовыгрузки.ВидДокумента + "." +  ИмяТЧ + " КАК Документ1СТЧ
				|			ПО Документ1С.Ссылка = Документ1СТЧ.Ссылка");
				
				Для каждого СтрПараметра Из ШаблонАвтовыгрузки.Ссылка.ПараметрыУсловияВыгрузкиТЧ Цикл
					ЗапросДокументовАвтовыгрузка.УстановитьПараметр(СтрПараметра.ИмяПараметра, СтрПараметра.ЗначениеПараметра);
				КонецЦикла;
			КонецЕсли;
			
			Если Найти(ШаблонАвтовыгрузки.УсловиеВыгрузки, "&ТекущаяДата") > 0 Тогда
				ЗапросДокументовАвтовыгрузка.УстановитьПараметр("ТекущаяДата", ТекущаяДата); // ПараметрПоУмолчанию
			КонецЕсли;       
			
			Первые = ШаблонАвтовыгрузки.ФоноваяАвтовыгрузкаКоличество;
						
	        ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "&Первые", Первые);  

			
			ДокументыАвтовыгрузка = ЗапросДокументовАвтовыгрузка.Выполнить().Выбрать();
			Пока ДокументыАвтовыгрузка.Следующий() Цикл		
				Если ШаблонАвтовыгрузки.МаркировкаВыгружатьРоботом Тогда
					ВидПродукцииИСДокумента = ДатаМобайл_Маркировка.ПолучитьВидПродукцииИСДокумента(ДокументыАвтовыгрузка.ИсходныйДокумент, ШаблонАвтовыгрузки.ИмяТабличнойЧастиПодбор);
					Если Не ЗначениеЗаполнено(ВидПродукцииИСДокумента) Тогда 
						Продолжить;
					КонецЕсли; 
					
					Если ТипЗнч(ВидПродукцииИСДокумента) = Тип("Массив") Тогда
						Если ВидПродукцииИСДокумента.Количество() > 0 Тогда
							Если Не ЗначениеЗаполнено(ВидПродукцииИСДокумента[0]) Тогда
								Продолжить;
							КонецЕсли; 		
						Иначе
							Продолжить;
						КонецЕсли;	
					КонецЕсли; 	
				КонецЕсли; 	
							
			КонецЦикла;   
			
			ДокументыАвтовыгрузка = ЗапросДокументовАвтовыгрузка.Выполнить().Выгрузить(); 
			
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст =       
		"ВЫБРАТЬ
		|	ВТ.ИсходныйДокумент КАК ИсходныйДокумент 
		|ПОМЕСТИТЬ ВТ
		|ИЗ &ВТ КАК ВТ
		|;
		|///////////////////////////
		|ВЫБРАТЬ 
		|	&ТипЗадания КАК ТипЗадания,
		|	&ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	"""" КАК ИдентификаторФоновогоЗадания,
		|	ИсходныйДокумент КАК ИсходныйДокумент
		|ИЗ ВТ КАК ВТ";   
		
		Запрос.УстановитьПараметр("ВТ", ДокументыАвтовыгрузка);
		Запрос.УстановитьПараметр("ИдентификаторЗадания", ИдентификаторЗадания);
		Запрос.УстановитьПараметр("ТипЗадания", 1);
		
		Результат = Запрос.Выполнить();      
		
		Если ДокументыАвтовыгрузка.Количество() = 0 Тогда
		
			НаборЗаписей = РегистрыСведений.ДатаМобайл_ФоновыеЗадания.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТипЗадания.Установить(1);
			НаборЗаписей.Отбор.ИдентификаторЗадания.Установить(ИдентификаторЗадания);
			НаборЗаписей.Прочитать();   
			НаборЗаписей.Очистить();
			НаборЗаписей.Загрузить(Результат.Выгрузить());  
			
			НаборЗаписей.Записать(Истина);   
			
		КонецЕсли;	
		
		Для каждого ДокументАвтовыгрузка Из ДокументыАвтовыгрузка Цикл

			ДокТСД = Справочники.ДатаМобайл_ДокументыТСД.СоздатьЭлемент();
			ДокТСД.ИсходныйДокумент = ДокументАвтовыгрузка.ИсходныйДокумент;
			ДокТСД.Шаблон = ШаблонАвтовыгрузки.Ссылка;
			ДокТСД.Записать();				
		
		КонецЦикла;	

	КонецЦикла;
 
	
КонецПроцедуры	
 
Процедура Автозагрузка(ИдентификаторЗадания = "") Экспорт 
	
	Модуль_ОбщегоНазначенияКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	КодОсновногоЯзыка = Модуль_ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка();
	
	ЗапросШаблоновАвтозагрузка = Новый Запрос();
	ЗапросШаблоновАвтозагрузка.Текст = 
	"ВЫБРАТЬ
	|	ДатаМобайл_ШаблоныДокументов.Ссылка КАК Ссылка,
	|	ДатаМобайл_ШаблоныДокументов.ФоноваяАвтозагрузкаКоличество,
	|	ДатаМобайл_ШаблоныДокументов.НеОстанавливатьАвтозагрузкуДокументаПриОшибках
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	ДатаМобайл_ШаблоныДокументов.ФоноваяАвтозагрузка
	|	И НЕ ДатаМобайл_ШаблоныДокументов.ПометкаУдаления
	|	И ДатаМобайл_ШаблоныДокументов.ОбрабатыватьРоботом";
	
	ШаблоныАвтозагрузка = ЗапросШаблоновАвтозагрузка.Выполнить().Выгрузить(); 
	ТекущаяДата = ДатаМобайл_ОбщийМодуль.ПолучитьТекущуюДату();   
	
	Для каждого ШаблонАвтозагрузки Из ШаблоныАвтозагрузка Цикл
		
		ЗапросДокументовАвтозагрузка = Новый Запрос();
		ЗапросДокументовАвтозагрузка.Текст =  	
		"ВЫБРАТЬ ПЕРВЫЕ &Первые
		|	ДатаМобайл_ФоновыеЗадания.ДокументТСД КАК Ссылка
		|ИЗ
		|	РегистрСведений.ДатаМобайл_ФоновыеЗадания КАК ДатаМобайл_ФоновыеЗадания
		|ГДЕ
		|	ДатаМобайл_ФоновыеЗадания.Шаблон = &Шаблон"; 
		
		ЗапросДокументовАвтозагрузка.Текст = СтрЗаменить(ЗапросДокументовАвтозагрузка.Текст, "&Первые", ШаблонАвтозагрузки.ФоноваяАвтозагрузкаКоличество);
			
		ЗапросДокументовАвтозагрузка.УстановитьПараметр("Шаблон", ШаблонАвтозагрузки.Ссылка);
		
		ДокументыАвтозагрузка = ЗапросДокументовАвтозагрузка.Выполнить().Выгрузить();   
		
		Если ДокументыАвтозагрузка.Количество() = 0 Тогда
			
			ЗапросДокументовАвтозагрузка.Текст =  
			
			"ВЫБРАТЬ ПЕРВЫЕ &Первые
			|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.Шаблон = &Шаблон   
			|	И ВЫБОР КОГДА ДатаМобайл_ДокументыТСД.Шаблон.ОбрабатыватьРоботомПланРавноФакт И НЕ ДатаМобайл_ДокументыТСД.ПланРавноФакт ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ
			|	И ДатаМобайл_ДокументыТСД.ДатаЗавершенияСбора <> ДАТАВРЕМЯ(1, 1, 1)
			|	И ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
			|	И НЕ ДатаМобайл_ДокументыТСД.ОшибкаПриАвтозагрузке";
			
			Первые = ШаблонАвтозагрузки.ФоноваяАвтозагрузкаКоличество;
						
	        ЗапросДокументовАвтозагрузка.Текст = СтрЗаменить(ЗапросДокументовАвтозагрузка.Текст, "&Первые", Первые);
	
			ДокументыАвтозагрузка = ЗапросДокументовАвтозагрузка.Выполнить().Выгрузить(); 
			
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст =       
		"ВЫБРАТЬ
		|	ВТ.Ссылка КАК ДокументТСД
		|ПОМЕСТИТЬ ВТ
		|ИЗ &ВТ КАК ВТ
		|;
		|///////////////////////////
		|ВЫБРАТЬ 
		|	&ТипЗадания КАК ТипЗадания,
		|	&ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	"""" КАК ИдентификаторФоновогоЗадания,
		|	ДокументТСД.Шаблон КАК Шаблон,
		|	ДокументТСД КАК ДокументТСД,
		|	ДокументТСД.ТСД КАК ТСД
		|ИЗ ВТ КАК ВТ";   
		
		Запрос.УстановитьПараметр("ВТ", ДокументыАвтозагрузка);
		Запрос.УстановитьПараметр("ИдентификаторЗадания", ИдентификаторЗадания);
		Запрос.УстановитьПараметр("ТипЗадания", 1);
		
		Результат = Запрос.Выполнить();      
		
		Если ДокументыАвтозагрузка.Количество() = 0 Тогда
		
			НаборЗаписей = РегистрыСведений.ДатаМобайл_ФоновыеЗадания.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТипЗадания.Установить(1);
			НаборЗаписей.Отбор.ИдентификаторЗадания.Установить(ИдентификаторЗадания);
			НаборЗаписей.Прочитать();   
			НаборЗаписей.Очистить();
			НаборЗаписей.Загрузить(Результат.Выгрузить());  
			
			НаборЗаписей.Записать(Истина);   
			
		КонецЕсли;	
		
		Для каждого ДокументАвтозагрузка Из ДокументыАвтозагрузка Цикл

			Об = ДокументАвтозагрузка.Ссылка.ПолучитьОбъект();
			Об.ДатаПриемкиОператором = ТекущаяДата;
			Об.ОшибкаПриАвтозагрузкеОписание = "";
			Об.Записать();
			
			СтрокаОшибок = "";
			
			Попытка 
				Док = Обработки.ДатаМобайл_АРМДиспетчера.ВнестиДокументВБазу(Об, СтрокаОшибок);
			Исключение
				СтрокаОшибок = ОписаниеОшибки();
			КонецПопытки;	
			
			Если СтрокаОшибок <> "" Тогда			
				
				ИмяСобытия = НСтр("ru = 'Документ DataMobile'", КодОсновногоЯзыка);
				
				ТекстСообщения = НСтр("ru = 'Не удалось загрузить документ DataMobile: %Справочник% по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Справочник%", ДокументыАвтозагрузка.Ссылка);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", " " + СтрокаОшибок);
				
				ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Справочники.ДатаМобайл_ДокументыТСД,
				ДокументыАвтозагрузка.Ссылка,
				ТекстСообщения); 
				
				Если ШаблонАвтозагрузки.НеОстанавливатьАвтозагрузкуДокументаПриОшибках Тогда
				Иначе	
					Об.ОшибкаПриАвтозагрузке 			= Истина;
					Об.ОшибкаПриАвтозагрузкеОписание 	= СтрокаОшибок;
					Об.ДатаЗавершения 					= Неопределено;
					Об.Записать();
				КонецЕсли;
			Иначе
				Обработки.ДатаМобайл_АРМДиспетчера.ЗаполнениеПроверкиИПодбораДокументаЕГАИС(Об.Ссылка, Док);	
			КонецЕсли; 	
		
		КонецЦикла;	

	КонецЦикла;
 
	
КонецПроцедуры	
 
Процедура Автоудаление(ИдентификаторЗадания = "") Экспорт  
	
	ЗапросШаблоновУдаление = Новый Запрос();
	ЗапросШаблоновУдаление.Текст = 
	
	"ВЫБРАТЬ
	|	ДатаМобайл_ШаблоныДокументов.УсловиеВыгрузки КАК УсловиеВыгрузки,
	|	ДатаМобайл_ШаблоныДокументов.ВидДокумента КАК ВидДокумента,
	|	ДатаМобайл_ШаблоныДокументов.Ссылка КАК Ссылка,
	|	ДатаМобайл_ШаблоныДокументов.УдалениеСтарыхДокументов КАК УдалениеСтарыхДокументов,
	|	ДатаМобайл_ШаблоныДокументов.ФоновоеАвтоудалениеКоличество
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	НЕ ДатаМобайл_ШаблоныДокументов.УдалениеСтарыхДокументов = 0
	|	И ДатаМобайл_ШаблоныДокументов.ФоновоеАвтоудаление
	|	И НЕ ДатаМобайл_ШаблоныДокументов.ПометкаУдаления";
	
	ШаблоныУдаление = ЗапросШаблоновУдаление.Выполнить().Выгрузить(); 
	ТекущаяДата = ДатаМобайл_ОбщийМодуль.ПолучитьТекущуюДату();
	
	Для каждого ШаблонУдаление Из ШаблоныУдаление Цикл	
		
		ЗапросДокументовУдаление = Новый Запрос();
		ЗапросДокументовУдаление.Текст =  	
		"ВЫБРАТЬ &Первые
		|	ДатаМобайл_ФоновыеЗадания.ДокументТСД КАК Ссылка,
		|	ДатаМобайл_ФоновыеЗадания.ДокументТСД.Дата КАК ДокументДата,
		|	ДатаМобайл_ФоновыеЗадания.ДокументТСД.ДатаЗавершения КАК ДатаЗавершения
		|ИЗ
		|	РегистрСведений.ДатаМобайл_ФоновыеЗадания КАК ДатаМобайл_ФоновыеЗадания
		|ГДЕ
		|	ДатаМобайл_ФоновыеЗадания.Шаблон = &Шаблон
		|	И ДатаМобайл_ФоновыеЗадания.ДокументТСД.ДатаЗавершения <= &Дата"; 
		
		Первые = ШаблонУдаление.ФоновоеАвтоудалениеКоличество;
		
		ЗапросДокументовУдаление.Текст = СтрЗаменить(ЗапросДокументовУдаление.Текст, "&Первые", "ПЕРВЫЕ " + Первые);
		
		Дата = ТекущаяДата - ШаблонУдаление.УдалениеСтарыхДокументов * 86400;
		
		ЗапросДокументовУдаление.УстановитьПараметр("Шаблон", ШаблонУдаление.Ссылка);
		ЗапросДокументовУдаление.УстановитьПараметр("Дата", Дата);
		ДокументыУдаление = ЗапросДокументовУдаление.Выполнить().Выгрузить();   
		
		Если ДокументыУдаление.Количество() = 0 Тогда
			
			ЗапросДокументовУдаление.Текст = 
			"ВЫБРАТЬ &Первые
			|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка,
			|	ДатаМобайл_ДокументыТСД.Дата КАК ДокументДата,
			|	ДатаМобайл_ДокументыТСД.ДатаЗавершения КАК ДатаЗавершения
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.Шаблон = &Шаблон
			|	И ДатаМобайл_ДокументыТСД.ДатаЗавершения > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	И ДатаМобайл_ДокументыТСД.Дата <= &Дата";  		
			ЗапросДокументовУдаление.Текст = СтрЗаменить(ЗапросДокументовУдаление.Текст, "&Первые", "ПЕРВЫЕ " + ШаблонУдаление.ФоновоеАвтоудалениеКоличество);
	
			ДокументыУдаление = ЗапросДокументовУдаление.Выполнить().Выгрузить();    
			
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст =       
		"ВЫБРАТЬ
		|	ВТ.Ссылка КАК ДокументТСД
		|ПОМЕСТИТЬ ВТ
		|ИЗ &ВТ КАК ВТ
		|;
		|///////////////////////////
		|ВЫБРАТЬ 
		|	&ТипЗадания КАК ТипЗадания,
		|	&ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	"""" КАК ИдентификаторФоновогоЗадания,
		|	ДокументТСД.Шаблон КАК Шаблон,
		|	ДокументТСД КАК ДокументТСД,
		|	ДокументТСД.ТСД КАК ТСД
		|ИЗ ВТ КАК ВТ";   
		
		Запрос.УстановитьПараметр("ВТ", ДокументыУдаление);
		Запрос.УстановитьПараметр("ИдентификаторЗадания", ИдентификаторЗадания);
		Запрос.УстановитьПараметр("ТипЗадания", 1);
		
		Результат = Запрос.Выполнить();      
		
		Если ДокументыУдаление.Количество() = 0 Тогда
		
			НаборЗаписей = РегистрыСведений.ДатаМобайл_ФоновыеЗадания.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТипЗадания.Установить(1);
			НаборЗаписей.Отбор.ИдентификаторЗадания.Установить(ИдентификаторЗадания);
			НаборЗаписей.Прочитать();   
			НаборЗаписей.Очистить();
			НаборЗаписей.Загрузить(Результат.Выгрузить());  
			
			НаборЗаписей.Записать(Истина);   
			
		КонецЕсли;	
		
		Для каждого ДокументУдаление Из ДокументыУдаление Цикл
					
			Попытка
				
				НачатьТранзакцию();
				
				ДокСсылка = ДокументУдаление.Ссылка; 
				
				НаборЗаписей = РегистрыСведений.ДатаМобайл_ФоновыеЗадания.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ДокументТСД.Установить(ДокСсылка);
				НаборЗаписей.Очистить(); 					
				НаборЗаписей.Записать(Истина);  
				
				ДокОбъект = ДокСсылка.ПолучитьОбъект();
				
				ДокОбъект.Удалить();
				
				ЗафиксироватьТранзакцию();
				
			Исключение   
				ОтменитьТранзакцию();
				ДокументУдаление.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			КонецПопытки;		
			
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры
